---
kind: type
id: T:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions
source: html/d321705f-3f3a-bdcd-759a-882f9f62964a.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions

This class contains options to control the behavior of interactive placement of family instances.

## Syntax (C#)
```csharp
public class PromptForFamilyInstancePlacementOptions : IDisposable
```